### Pandas 기초

In [3]:
import pandas as pd
import numpy as np

In [4]:
s = pd.Series([1,3,5,np.nan,6,8]) #NaN은 아무것도 없는(빈) 값
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
dates = pd.date_range('20130101', periods = 6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6,4), index = dates, columns = ['A', 'B', 'C', 'D']) #DataFrame은 딕셔너리나 array형 자료를 받습니다
df

                   A         B         C         D
2013-01-01  0.394101  0.063635 -0.258881 -2.229429
2013-01-02 -0.240865  1.004641  0.002367  0.630268
2013-01-03 -0.206539  0.936251  0.830461  0.391564
2013-01-04 -0.697200 -0.277341 -0.252726  0.836142
2013-01-05 -0.886381 -1.268943  0.954613 -1.372374
2013-01-06  0.228759  0.301199 -0.347307 -0.595318

In [7]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [8]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [9]:
df.values

array([[ 0.39410101,  0.06363524, -0.25888058, -2.22942909],
       [-0.24086505,  1.00464143,  0.00236681,  0.63026767],
       [-0.20653889,  0.93625075,  0.83046144,  0.39156398],
       [-0.69719975, -0.27734052, -0.25272622,  0.83614188],
       [-0.88638069, -1.26894313,  0.95461329, -1.37237356],
       [ 0.22875866,  0.30119907, -0.34730713, -0.59531783]])

In [10]:
df.describe() #각종 요약값 제공

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.234687  0.126574  0.154755 -0.389858
std    0.499922  0.845180  0.584598  1.228489
min   -0.886381 -1.268943 -0.347307 -2.229429
25%   -0.583116 -0.192097 -0.257342 -1.178110
50%   -0.223702  0.182417 -0.125180 -0.101877
75%    0.119934  0.777488  0.623438  0.570592
max    0.394101  1.004641  0.954613  0.836142

In [11]:
df.sort_values(by = 'B', ascending = False)

                   A         B         C         D
2013-01-02 -0.240865  1.004641  0.002367  0.630268
2013-01-03 -0.206539  0.936251  0.830461  0.391564
2013-01-06  0.228759  0.301199 -0.347307 -0.595318
2013-01-01  0.394101  0.063635 -0.258881 -2.229429
2013-01-04 -0.697200 -0.277341 -0.252726  0.836142
2013-01-05 -0.886381 -1.268943  0.954613 -1.372374

In [12]:
df['B']

2013-01-01    0.063635
2013-01-02    1.004641
2013-01-03    0.936251
2013-01-04   -0.277341
2013-01-05   -1.268943
2013-01-06    0.301199
Freq: D, Name: B, dtype: float64

In [13]:
df[0:3] #슬라이싱은 행 단위로 실행

                   A         B         C         D
2013-01-01  0.394101  0.063635 -0.258881 -2.229429
2013-01-02 -0.240865  1.004641  0.002367  0.630268
2013-01-03 -0.206539  0.936251  0.830461  0.391564

In [14]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.240865  1.004641  0.002367  0.630268
2013-01-03 -0.206539  0.936251  0.830461  0.391564
2013-01-04 -0.697200 -0.277341 -0.252726  0.836142

In [15]:
df.loc[dates[0]]

A    0.394101
B    0.063635
C   -0.258881
D   -2.229429
Name: 2013-01-01 00:00:00, dtype: float64

In [16]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  0.394101  0.063635
2013-01-02 -0.240865  1.004641
2013-01-03 -0.206539  0.936251
2013-01-04 -0.697200 -0.277341
2013-01-05 -0.886381 -1.268943
2013-01-06  0.228759  0.301199

In [17]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02 -0.240865  1.004641
2013-01-03 -0.206539  0.936251
2013-01-04 -0.697200 -0.277341

In [18]:
df.loc[dates[0], 'A']

0.39410100804632797

In [19]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.697200 -0.277341
2013-01-05 -0.886381 -1.268943

In [20]:
df.iloc[[1,2,4], [0,2]]

                   A         C
2013-01-02 -0.240865  0.002367
2013-01-03 -0.206539  0.830461
2013-01-05 -0.886381  0.954613

In [21]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -0.240865  1.004641  0.002367  0.630268
2013-01-03 -0.206539  0.936251  0.830461  0.391564

In [22]:
df[df['A']>0]

                   A         B         C         D
2013-01-01  0.394101  0.063635 -0.258881 -2.229429
2013-01-06  0.228759  0.301199 -0.347307 -0.595318

In [23]:
df[df>0] #value가 0이상인 값만 반환하고 이외에는 NaN 형태로 반환

                   A         B         C         D
2013-01-01  0.394101  0.063635       NaN       NaN
2013-01-02       NaN  1.004641  0.002367  0.630268
2013-01-03       NaN  0.936251  0.830461  0.391564
2013-01-04       NaN       NaN       NaN  0.836142
2013-01-05       NaN       NaN  0.954613       NaN
2013-01-06  0.228759  0.301199       NaN       NaN

In [24]:
df2 = df.copy() #원본 df에는 변화를 적용하고 싶지 않다면 copy()를 사용해야 한다. 그냥 df2 = df로 하면 df2에 적용된 코드가 df에도 적용됨.
df2

                   A         B         C         D
2013-01-01  0.394101  0.063635 -0.258881 -2.229429
2013-01-02 -0.240865  1.004641  0.002367  0.630268
2013-01-03 -0.206539  0.936251  0.830461  0.391564
2013-01-04 -0.697200 -0.277341 -0.252726  0.836142
2013-01-05 -0.886381 -1.268943  0.954613 -1.372374
2013-01-06  0.228759  0.301199 -0.347307 -0.595318

In [25]:
df2['E'] = ['one', 'two', 'three', 'four', 'five', 'six']

In [26]:
df2

                   A         B         C         D      E
2013-01-01  0.394101  0.063635 -0.258881 -2.229429    one
2013-01-02 -0.240865  1.004641  0.002367  0.630268    two
2013-01-03 -0.206539  0.936251  0.830461  0.391564  three
2013-01-04 -0.697200 -0.277341 -0.252726  0.836142   four
2013-01-05 -0.886381 -1.268943  0.954613 -1.372374   five
2013-01-06  0.228759  0.301199 -0.347307 -0.595318    six

In [27]:
df2['E'].isin(['two', 'four'])

2013-01-01    False
2013-01-02     True
2013-01-03    False
2013-01-04     True
2013-01-05    False
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [28]:
df2[df2['E'].isin(['two', 'four'])] #'E'행의 값이 'two'나 'four'인 열들을 반환

                   A         B         C         D     E
2013-01-02 -0.240865  1.004641  0.002367  0.630268   two
2013-01-04 -0.697200 -0.277341 -0.252726  0.836142  four

In [29]:
df2.drop('E',axis = 1)

                   A         B         C         D
2013-01-01  0.394101  0.063635 -0.258881 -2.229429
2013-01-02 -0.240865  1.004641  0.002367  0.630268
2013-01-03 -0.206539  0.936251  0.830461  0.391564
2013-01-04 -0.697200 -0.277341 -0.252726  0.836142
2013-01-05 -0.886381 -1.268943  0.954613 -1.372374
2013-01-06  0.228759  0.301199 -0.347307 -0.595318

In [30]:
df2

                   A         B         C         D      E
2013-01-01  0.394101  0.063635 -0.258881 -2.229429    one
2013-01-02 -0.240865  1.004641  0.002367  0.630268    two
2013-01-03 -0.206539  0.936251  0.830461  0.391564  three
2013-01-04 -0.697200 -0.277341 -0.252726  0.836142   four
2013-01-05 -0.886381 -1.268943  0.954613 -1.372374   five
2013-01-06  0.228759  0.301199 -0.347307 -0.595318    six

In [31]:
df2 = df2.drop('E',axis = 1)

### DataFrame 병합하기

#### concat

In [32]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                   'B': ['B0', 'B1', 'B2', 'B3'],
                   'C': ['C0', 'C1', 'C2', 'C3'],
                   'D': ['D0', 'D1', 'D2', 'D3']},
                  index = [0,1,2,3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                   'B': ['B4', 'B5', 'B6', 'B7'],
                   'C': ['C4', 'C5', 'C6', 'C7'],
                   'D': ['D4', 'D5', 'D6', 'D7']},
                  index = [4,5,6,7])

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                   'B': ['B8', 'B9', 'B10', 'B11'],
                   'C': ['C8', 'C9', 'C10', 'C11'],
                   'D': ['D8', 'D9', 'D10', 'D11']},
                  index = [8,9,10,11])

In [33]:
result = pd.concat([df1, df2, df3]) #열 방향으로 dataframe을 병합
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [34]:
result = pd.concat([df1, df2, df3], keys = ['x', 'y','z']) #key는 인덱스와 비슷하다고 보면 됩니다
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [35]:
result.index

MultiIndex([('x',  0),
            ('x',  1),
            ('x',  2),
            ('x',  3),
            ('y',  4),
            ('y',  5),
            ('y',  6),
            ('y',  7),
            ('z',  8),
            ('z',  9),
            ('z', 10),
            ('z', 11)],
           )

In [36]:
result.index.get_level_values(0)

Index(['x', 'x', 'x', 'x', 'y', 'y', 'y', 'y', 'z', 'z', 'z', 'z'], dtype='object')

In [37]:
result.index.get_level_values(1)

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11], dtype='int64')

In [38]:
left = pd.DataFrame({'key': ['K0','K4','K2','K3'],
                    'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3']})
right = pd.DataFrame({'key': ['K0','K1','K2','K3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']})

#### join

In [39]:
left

  key   A   B
0  K0  A0  B0
1  K4  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [40]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [41]:
pd.merge(left, right, on = 'key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3

In [42]:
pd.merge(left, right, how = 'left', on = 'key') #왼쪽 데이터프레임을 기준으로 병합

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K4  A1  B1  NaN  NaN
2  K2  A2  B2   C2   D2
3  K3  A3  B3   C3   D3

In [43]:
pd.merge(left, right, how = 'right', on = 'key')

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1  NaN  NaN  C1  D1
2  K2   A2   B2  C2  D2
3  K3   A3   B3  C3  D3

In [44]:
pd.merge(left, right, how = 'outer', on = 'key') #how 값의 기본 옵션은 inner(교집합)이다

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K4   A1   B1  NaN  NaN
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
4  K1  NaN  NaN   C1   D1

### DataFrame 저장하고 불러오기

In [58]:
df = pd.merge(left, right, how = 'outer', on = 'key')

In [59]:
df

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K4   A1   B1  NaN  NaN
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
4  K1  NaN  NaN   C1   D1

#### 'C:/Users/NH/SoomgoKES/data' 폴더에 df라는 csv 파일로 저장된다.

In [60]:
df.to_csv('data/df.csv',index = False) # index는 저장하지 않겠다는 뜻

In [61]:
import os

In [62]:
os.getcwd()

'C:\\Users\\NH\\SoomgoKES'

In [63]:
df = pd.read_csv('data/df.csv', index_col = 0)

In [64]:
df

       A    B    C    D
key
K0    A0   B0   C0   D0
K4    A1   B1  NaN  NaN
K2    A2   B2   C2   D2
K3    A3   B3   C3   D3
K1   NaN  NaN   C1   D1